package poc3;

public class Mango {

	public static void main(String[] args) {
		
		float boxweight =0;
		float mangoweight =0;
		float labelWeight = 3.1f;
		float afterweight = 2.8f;
		int mangoNum =3;
//		假设：箱子+4个芒果= 3.1,  箱子+3个芒果=2.8
//				解方程可得：箱子重1.9公斤， 芒果每个0.3公斤。
//
//				问题是箱子有1.9公斤么？
//				当时快递应该列个方程式就可以知道。
//				或称一下芒果平均多重。或称一下箱子多重。
//				那么是否少一个就很明白了。
//
//				当时快递员是坚决不赔，因为他们认为0.3kg的芒果不可能。= 
//				凡是发表文章却禁止评论的，一律拉黑不看。
//				我是自来水军。哈哈哈。
//
//				从现在开始每天4，5题Leetcode
//				个人观点
//				人工智能和大数据必定能够普及
//				软件设计和实现是一体的，不能用工厂那套管理。比较类似的是艺术，商业类的管理管理就是管人。技术官僚不懂技术则不可能有效管理。比特币无用，去中心化不能太绝对，少中心是个方向。nodejs是个大坑golang, vertx是个方向，比akka还好用往事一直在重复 以不同的面目，一个程序员对世界的看法
//				
		
		
	}
}
